[
    {
    "id": 0,
    "leafName": "Alpinia Galanga (Rasna)",
    "ScientificName" : "Pluchea lanceolata",
    "found": "Punjab, Upper Gangetic plains, Rajasthan and Gujarat",
    "nutrients": "Vitamin A, Vitamin K",
    "plantDescription": "The plant grows from rhizomes in clumps of stiff stalks up to 2 metres (6 ft 7 in) in height with abundant long leaves that bear red fruit. This plant's rhizome is the galangal used most often in cookery.It is valued for its use in food and traditional medicine, and is regarded as being superior to ginger.[by whom?] The rhizome has a pungent smell and strong taste reminiscent of black pepper and pine needles. Red and white cultivars are often used differently, with red cultivars being primarily medicinal, and white cultivars primarily as a spice. The red fruit is used in traditional Chinese medicine and has a flavor similar to cardamom",
    "habitat": "Alpinia Galanga is native to Southeast Asia. Its original center of cultivation during the spice trade was Java, and today it is still cultivated extensively in Island Southeast Asia, most notably in the Greater Sunda Islands and the Philippines. Its cultivation has also spread into Mainland Southeast Asia, most notably Thailand.",
    "MedicinalUses" : ["An excellent medicine useful in treating respiratory problems like asthma, pleuritic, bronchitis and chest pain.",
    "Used in treating digestive diseases like flatulence, abdominal pain, colic pain, bloating and indigestion.",
    "Rasna is very useful in treating anomalies related to female genital system like amenorrhea and dysmenorrhea.",
    "It has anti-pyretic properties which is useful in skin diseases like worm infection, itching, irritable skin and eczema.",
    "The anti-ageing properties of Rasna helps delaying the ageing process.",
    "Rasna reduces the joint pains, alleviates dryness in joints and can treat many neurological disorders.",
    "The leaves of Rasna are used as laxative, analgesic and antipyretic.",
    "The traditional medicines use Rasna to treat arthritis problems."],
    "HealthBenefits" : ["It purifies the blood and reduces the toxins in blood due to its anti-toxic properties.",
    "It has its importance in treating disorders related to musculoskeletal system and also to cure tuberculosis.",
    "Rasna nourishes the skin and tissue layers and reduces the inflammation."]
    },
    {
    "id": 1,
    "leafName": "Aranthus Viridis (Arive-Dantu) (slender amaranth)",
    "ScientificName" : "Amaranthus viridis",
    "found": "Argentina Northeast, Argentina Northwest, Aruba, Bahamas, Belize, Bolivia, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Cayman Is., Colombia, Cuba, Dominican Republic, Ecuador, El Salvador, French Guiana, Galápagos, Guatemala, Haiti, Honduras, Jamaica, Leeward Is.",
    "nutrients": "Vitamin C, Vitamin B6",
    "plantDescription": "Amaranthus viridis is an annual herb with an upright, light green stem that grows to about 60–80 cm in height. Numerous branches emerge from the base, and the leaves are ovate, 3–6 cm long, 2–4 cm wide, with long petioles of about 5 cm. The plant has terminal panicles with few branches, and small green flowers with 3 stamens.",
    "habitat": "Amaranthus Viridis is found in virtually all disturbed habitats. It grows in heavy organic to very sandy soils, including muck soils after the water has gone down for the season.",
    "MedicinalUses" : ["The plant is emollient and vermifuge",
        "A decoction of the entire plant is used to stop dysentery and inflammations, and also to purify the blood.",
        "The root juice is used to treat inflammation during urination.", 
        "It is also taken to treat constipation.",
        "The pounded root is applied against dysentery.",
        "The leaves are diuretic, febrifuge and purgative.", 
        "The leaf sap is said to act as a vermifuge, being effective against filaria, as an emmenagogue and to relieve heart troubles.",
        "The leaves are used in poultices (fresh or as dried powder) to treat inflammations, boils and abscesses, gonorrhoea, orchitis and haemorrhoids.", 
        "The leaf sap is used as an eye wash to treat eye infections."],
    "HealthBenefits" : ["Storehouse of Nutrients : Amaranth leaves are a storehouse of essential phytonutrients and antioxidants which help to reduce inflammation in the body and provide an extra boost of nutrition to one’s health.",
    "Low in Calories : 100gms of Amaranth leaves carry only unbelievably light baggage of just 23 calories. Traces of fat and absolutely no cholesterol make them a healthy go-to food option, especially those who are watching their weight or who want to reduce.",
    "High in Fiber : Amaranth leaves are rich in soluble and insoluble fibre that has many benefits. Eating fibre helps us to reduce our weight and wards off heart disease as it lowers the cholesterol in the blood. Amaranth is high in protein and fibre, both of which may help reduce appetite and increase weight loss.",    
    "Good for Anemics : Iron is needed for producing red blood cells and is also needed for cellular metabolism. Reap maximum benefits of this powerful punch of iron that amaranth leaves provide by adding some source of vitamin C as it facilitates maximum absorption of iron in the blood. So, you could add a dash of lemon or have the amaranth leaves dish with a glass of orange juice. Also, read iron-rich diet to fight deficiency.",
    "Boosts Immunity : Here is another reason why you should make amaranth leaves a regular part of your diet."]
  },
    {
    "id": 2,
    "leafName": "Artocarpus Heterophyllus (Jackfruit)",
    "ScientificName" : "Artocarpus heterophyllus",
    "found": "Andaman & Nicobar Island, Assam, Madhya Pradesh, Maharastra, Manipur, Kerala, Odisha, Tamil Nadu,Throughout Assam",
    "nutrients": "Energy 95 kcal; total fat 0.6gm; carbohydrate 23 gm; protein 1.5 gm; dietary fibres 1.5 gm; sugar 19 gm; vitamin A 0.03 gm; vitamin C 13.7 gm; vitamin B6 0.15gm; sodium 2mg; potassium 448mg; calcium 36 mg; iron 0.01 mg & magnesium 37 mg, per 100gm",
    "plantDescription": "The tree is handsome and stately, 30 to 70 ft (9-21 m) tall, with evergreen, alternate, glossy, somewhat leathery leaves to 9 in (22.5 cm) long, oval on mature wood, sometimes oblong or deeply lobed on young shoots. ",
    "habitat": "No one knows the jackfruit's place of origin but it is believed indigenous to the rainforests of the Western Ghats. It is cultivated at low elevations throughout India, Burma, Ceylon, southern China, Malaya, and the East Indies.",
    "MedicinalUses" : [
      "The Chinese consider jackfruit pulp and seeds tonic, cooling and nutritious, and to be 'useful in overcoming the influence of alcohol on the system.", 
      "The seed starch is given to relieve biliousness and the roasted seeds are regarded as aphrodisiac.",
      "The ash of jackfruit leaves, burned with corn and coconut shells, is used alone or mixed with coconut oil to heal ulcers.",
      "The dried latex yields artostenone, convertible to artosterone, a compound with marked androgenic action.",
      "Mixed with vinegar, the latex promotes healing of abscesses, snakebite and glandular swellings."],
    "HealthBenefits" : [
      "Jackfruit (Artocarpus heterophyllus Lam) is a rich source of several high-value compounds with potential beneficial physiological activities.", 
      "It is well known for its antibacterial, antifungal, antidiabetic, anti-inflammatory, and antioxidant activities",
      "Jackfruit contains functional compounds that have capability to reduce various diseases such as high blood pressure, heart diseases, strokes, and bone loss.", 
      "It is also capable of improving muscle and nerve function, reducing homocysteine levels in the blood ",
      "Jackfruit is also rich in potassium which aids in lowering blood pressure and reversing the effects of sodium that causes a rise in blood pressure that affects the heart and blood vessels.",
      "The flesh and seeds of jackfruit are considered as a cooling and nutritious tonic.",
      "Jackfruit is also a good source of vitamin C, which protects the skin from the damage that occurs as a consequence of the natural aging process and prolonged exposure to sun. Vitamin C is also essential for the production of collagen, gives firmness and strength to the skin, and maintains oral health."]
    },
    {
      "id": 3,
      "leafName": "Azadirachta Indica (Neem)",
      "ScientificName" : "Azadirachta indica",
      "found": " Azadirachta Indica, It is considered to be native to dry areas in Afghanistan, Pakistan, India, Sri Lanka, Bangladesh, Myanmar and China (Abdulla, 1972; Tewari, 1992; Vietmeyer, 1992; Gupta, 1993). It is cultivated as well as naturalized in Thailand, Malaysia and Indonesia. ",
      "nutrients": "Neem leaves have a moderate to good protein content (12-20% DM), moderate NDF and ADF contents but a high level of lignin (10-15% DM). Neem leaves contain high amounts of calcium but low amounts of phosphorus.",
      "plantDescription": "A. indica is a medium to large, deep-rooted, evergreen tree, to 15(30) m tall, with a round, large crown to 10(20) m in diameter; branches spreading; bole branchless for up to 7.5 m, up to 90 cm in diameter, sometimes fluted at base; bark moderately thick, with small, scattered tubercles, deeply fissured and flaking in old trees, dark grey outside and reddish inside, with colourless, sticky foetid sap. Leaves alternate, crowded near the end of branches, simply pinnate, 20- 40 cm long, light green, with 2 pairs of glands at the base, otherwise glabrous; petiole 2-7 cm long, subglabrous; rachis channeled above; leaflets 8-19, very short petioluled, alternate proximally and more or less opposite distally, ovate to lanceolate, sometimes falcate (2) 3.5-10 × 1.2-4 cm, glossy, serrate; apex acuminate; base unequal.",
      "habitat": "In India and Pakistan, A. indica occurs naturally in dry deciduous and thorn forests (Champion et al., 1965), and grows in mixed forests with Acacia species and Dalbergia sissoo in India (World Agroforestry Centre, 2002). In its exotic range, it is reported to have become invasive in a number of habitats including fallow agricultural land, savannah, and dry and arid forests (Hamilton A, World Wide Fund for Nature, Godalming, UK, personal communication, 2002), coastal forest in Ghana (Chamberlain 2000), lowland monsoon forest in Indonesia and evergreen forest and dry deciduous forest in Africa (World Agroforestry Centre, 2002).",
      "MedicinalUses" : [
        "Treats Acne : Neem has an anti-inflammatory property which helps reduces acne. Azadirachta Indica also helps reduce skin blemishes.",
        "Nourishes Skin : Neem is a rich source of Vitamin E which help repair damaged skin cells.",
        "Treats Fungal Infections : Neem has scientifically proven antifungal property which helps treat fungal infections.",
        "Useful in Detoxification : Neem can prove useful in detoxification both internally and externally. Consumption of neem leaves or powder stimulates kidneys and liver increasing the metabolism and eliminating the toxins out of the body. Externally, neem scrubs or paste can be used to remove germs, bacteria, dirt, etc from your skin preventing rashes and skin diseases.",
        "Increases Immunity : Neem is known for its antimicrobial and antibacterial effects. These properties play a huge role in boosting immunity.",
        "Insect & Mosquito Repellent : You can burn a few neem leaves to ward off the insects. This is also effective against different types of mosquitoes . From all the home remedies for malaria , neem is the best for treating the early symptoms of malaria.",
        "Prevents Gastrointestinal Diseases : Neem's anti-inflammatory properties help reduce inflammation of the gastrointestinal tract which helps reduce a series of diseases like constipation, stomach ulcer, flatulence, etc. Try out these home remedies for constipation.",
        "Treats Wounds : Neem leaves have an antiseptic property which is why it is used to heal wounds.",
        "Reduces Dandruff : Neem is extensively used in shampoos and conditioners. Azadirachta Indica has antifungal and antibacterial properties which help eliminate dandruff and strengths your hair.",
        "Reduces Joint Pain : Application of neem oil or extract on the affected area can help reduce pain and discomfort. Hence it is widely used for treating arthritis.",
        "Exfoliates skin : Neem is an excellent exfoliant. It helps remove dead cells from the surface of the skin which will help prevent the growth of blemishes."],
      "HealthBenefits" : [
        "Neem leaf is used for leprosy, eye disorders, bloody nose, intestinal worms, stomach upset, loss of appetite, skin ulcers, diseases of the heart and blood vessels (cardiovascular disease), fever, diabetes, gum disease (gingivitis), and liver problems.", 
        "The leaf is also used for birth control and to cause abortions."]
      },
      {
      "id": 4,
      "leafName": "Basella Alba (Basale)",
      "ScientificName" : "Basella Alba",
      "found": "Africa, Algeria, Angola, Asia, Australia, Bahamas, Bangladesh, Benin, Bhutan, Brazil, Burma, Cuba, East Africa, Ethiopia, Fiji, France, Ghana, Guiana, Guinea-Bissau, Guyana, Haiti, Hawaii, India, Indonesia, Indochina, Ivory Coast, Jamaica, Japan,  West Indie.",
      "nutrients": "Energy 19 kcal; carbohydrate 3.4 gm; protein 1.8 gm; total fat 0.3 gm; vitamin C 102 mg; Riboflavin 0.15mg; sodium 24mg; potassium 510 mg; calcium 109 mg; Magnesium 65mg; iron 1.2mg, zinc 0.43mg and small amount of beta-carotene per 100 gm",
      "plantDescription": "Perennial twining herb. Stem stout at the base, 1.5-2.0 cm in diameter, upper branches slender, fleshy and climbing. Leaves dark green, broadly ovate, 5-13 cm long and 2.5-8 cm broad, acute or acuminate, basally cordate, cuneate or truncate; ",
      "habitat": "Moist places in hedges to elevations of about 500 metres in Nepal",
      "MedicinalUses" : [
        "The roots are astringent. They are cooked and used in the treatment of diarrhoea.", 
        "A paste of the root is applied to swellings and is also used as a rubefacient.",
        "The leaves and stems are cooked and eaten for their laxative properties.", 
        "The leaf juice is a demulcent, used in cases of dysentery.", 
        "It is also diuretic, febrifuge and laxative.",
        "The leaf juice is used in Nepal to treat catarrh.", 
        "A paste of the leaves is applied externally to treat boils and sores.", 
        "The flowers are used as an antidote to poisons."],
      "HealthBenefits" : [
        "Healthy heart : Folate is essential to reduce the homocysteine level which is present in the blood. Homocysteine increases the chances of strokes and heart attacks. Folate helps to convert the homocysteine into methionine which normalizes the level of homocysteine. It has a positive role in metabolizing minerals as well as antioxidant activities. The studies have shown that high intake of folate reduces the chances of cardiovascular disease.",    
        "Treats depression : The intake of folate with adequate amount of veggies as well as plant foods helps to treat the depression naturally. The high intake of folate helps to lower the depression significantly in depressed patients.",    
        "Prevent dementia : The studies show that high levels of homocysteine increases the chances of dementia and Alzheimer’s disease. The low amount of folate in the body leads to poor mental activities.",    
        "The folic acid decreases the level of homocysteine but it has not been proved that it improves the cognitive function and forbid diseases. The addition of diet rich in folate and nutrients helps to treat the Alzheimer’s disease.",    
        "Treatment for cancer : The low presence of folate in the body increases the chances of colon, cervical, breast, lung and brain cancer. The evidence has shown that the diet rich in folate protects from cancer development. One should intake the natural forms of Vitamin because the pharmaceutical form of vitamin differs from natural ones which provide the protection.",    
        "Utilizes amino acids, iron and vitamin B12 : Anemia is also one of the causes of folate deficiency. It is the health condition where the red blood cells are formed improperly.  Folate assists in the absorption of Vitamin B12 which helps to absorb the nutrients, brain function and provides energy.",    
        "Pregnancy : Folate is one of the vital vitamin which is required for the having healthy pregnancy. The deficiency of folate results in neural tube defects such as anencephaly, spina bifida, limb malformations and heart ailments. Folate is vital for copying DNA and builds the new cells. Low levels of folate leads to developments issues which remain after birth as well. Leafy greens, avocados, sprouted beans and citrus are the folate rich foods which one should intake during pregnancy.",    
        "Provides energy : Anemia is the result of iron deficiency. The low amount of iron results in low hemoglobin due to which adequate amount of oxygen could not be transported to the cells. The iron deficiency leads to poor mental function, lack of energy and apathy. Children and pre-menopausal women are in high chances of suffering from anemia if they do not consume the foods iron rich foods."]
      },
      {
      "id": 5,
      "leafName": "Brassica Juncea (Indian Mustard)",
      "ScientificName" : "Brassica Juncea",
      "found": "This species is distributed worldwide, except in northern and polar areas with an annual average temperature below 6°C. Its original distribution is believed to be between Eastern Europe and China, where the range of its parent species, Brassica nigra and Brassica rapa, overlap, with centres of diversity in central and western China, eastern India, Myanmar, and through Iran to the Near East. It has been cultivated for centuries in many parts of Eurasia. These days, the species is mainly grown in Bangladesh, Central Africa, China, India, Japan, Nepal and Pakistan, as well as southern Russia north of the Caspian Sea.",
      "nutrients": "Vitamin K (691.50%), Vitamin A (123.57%), Vitamin C (39.33%), Selenium (34.78%), Copper (22.67%)",
      "plantDescription": "Brassica juncea is an annual herb in the cruciferous family.  The genus name Brassica is Latin for cabbage.  It has been introduced to all of North America from Eurasia.  It is listed as invasive in some mid-western states.  However, the leaves and flowers of certain cultivars are cultivated for use in the edible garden, having a hot mustard flavor.  Young leaves can be eaten in mixed salads and older leaves are usually cooked as greens.  Some areas of the world also grow it for its spicy seeds.",
      "habitat": "This is a cultivated and naturalized species around the world. In the wild it is mainly found in fields, wasteland and roadsides as a weed.",
      "MedicinalUses" : ["Prevents spread of cancer cells: Isothiocyanates, derived from glucosinolates, and myrosinase in mustard prevents cancer cells from growing or spreading. Flavonoid antioxidants mustard protects against certain types of cancers.",
        "Protects from diabetes: Flavonoid antioxidants in mustard also protects from Type 2 diabetes. A mustard green decoction taken together with blood-sugar-lowering medication may lower blood sugar levels in people with Type 2 diabetes more effectively than medication alone.",
        "Helps in skin conditions: Mustard seeds may reduce inflammation and promote the healing of psoriasis-caused lesions. Mustard seeds may also speed healing and reduce symptoms of contact dermatitis. Mustard seeds also help in hydrating skin, removing impurities, acting as a scrub and protecting against acne. Vitamins A, K, and C, in mustard can help reduce the signs of ageing."],
      "HealthBenefits" : ["Reduces Symptoms of Arthritis", "Prevents Urinary Stones", "Fights off Colds and Flu", "Pregnant Women", "Fights Cancer", "Heart health", "Prevents Acne", "Eye health protection", "Improves mental health", "Rich in Antioxidants", "Healthy joints & bone health"]
      },
      {
      "id": 6,
      "leafName": "Carissa Carandas (Karanda)",
      "ScientificName" : "Carissa carandas",
      "found": "It is found wild in Bihar, West Bengal and South India. ",
      "nutrients": "The nutritional profile of the karonda plant is quite impressive, being rich in vitamin C, the B vitamins and iron, thus effectively flushing out free radicals and rectifying anaemia.",
      "plantDescription": "The karanda is a sprawling semi-vine shrub native to India. Leaves are from one-and-a-half to two-and-a-half inches long, very dark green, shiny and opposite and they have large spines like many other Carissas. ",
      "habitat": "The plant is grown wild and thrives on the poorest and rockiest soil in India. It requires moist, fertile, and well-drained soil for higher fruit production",
      "MedicinalUses" : [
        "Its fruit is used in the ancient Indian herbal system of medicine, Ayurvedic, to treat acidity, indigestion, fresh and infected wounds, skin diseases, urinary disorders and diabetic ulcer, as well as biliousness, stomach pain, constipation, anemia, skin conditions, anorexia and insanity.",
        "Leaf decoction is used to treat fever, diarrhea, and earache.",
        "The roots serve as a stomachic, an anthelmintic medicine for itches and also as insect repellents."],
      "HealthBenefits" : [
        "Alleviates Abdominal Pain : Rich in fibre, the fruit is extremely beneficial for treating abdominal problems. Dried fruit powder can be mixed with water and consumed to ease the stomach tissues and help eliminate indigestion, gas, and bloating. Also Read: Bloating: Try These Kitchen Wonders To Soothe Bloated Tummy",
        "Improves Digestion : The presence of pectin in the fruit makes it beneficial for improving digestion. The soluble fibre improves the functioning of digestive system, thereby improving appetite as well and curbing untimely cravings.",
        "Reduces Fever : With an ample amount of vitamin C present in the fruit, karonda has been used since ages for treating fever. Being rich in antioxidants, the tasty fruit helps in bringing down the fever by fighting off the infections. Consuming ripe or dried fruit vastly helps to manage fevers.",
        "Improves Mental Health : Regular consumption of karonda fruit is asserted to be beneficial for improving one's mental health. The presence of magnesium along with the vitamins and tryptophan help stimulate the production of the neurotransmitter - serotonin - which works towards bettering overall mental well-being.",
        "Strengthens Cardiac Muscles : Drinking the juice of karonda fruit is extremely beneficial for cardiac health. Consume a glass of the fruit juice two or three times a week, to strengthen cardiac muscles, lower the risk of heart diseases like heart attack and hypertension as well as ensure optimal blood circulation to all organs in the body."]
      },
      {
      "id": 7,
      "leafName": "Citrus Limon (Lemon)",
      "ScientificName" : "Citrus Limon",
      "found": "Lemon trees (Citrus limon) love warm temperatures. The trees are thought to have originated in India and are usually grown in warmer climates, such as in Italy, California and Florida. ",
      "nutrients": "Lemon is a rich source of vitamin C",
      "plantDescription": "Citrus limon is an evergreen Shrub growing to 3 m (9ft) by 1 m (3ft 3in) at a medium rate. It is hardy to zone (UK) 9 and is frost tender. It is in leaf all year, in flower all year. ",
      "habitat": "Citrus limon trees are found in tropical and subtropical climates.  They thrive in places where the temperature is between 16 degrees Celsius and 29 degrees Celsius (60.8 degrees Fahrenheit and 84.2 degrees Fahrenheit) and they are sensitive to cold temperatures. ",
      "MedicinalUses" : [
        "The fruit is rich in vitamin C which helps the body to fight off infections and also to prevent or treat scurvy.", 
        "It was at one time a legal requirement that sailors should be given an ounce of lemon each day in order to prevent scurvy.", 
        "Applied locally, the juice is a good astringent and is used as a gargle for sore throats etc.",
        "Lemon juice is also a very effective bactericide."],
      "HealthBenefits" : [
        "Problems making saliva due to radiation therapy.",
        "Decreasing swelling.",
        "Infection of the airways.",     
        "Hay fever.",
        "Kidney stones.",
        "Increasing urine.",
        "An inner ear disorder marked by dizziness, hearing loss, and ringing in the ear (Meniere disease).",
        "Obesity.",
        "A disease caused by vitamin C deficiency (scurvy).",
        "Skin care, when applied to the skin."]
      },
      {
      "id": 8,
      "leafName": "Ficus Auriculata (Roxburgh fig)",
      "ScientificName" : "Ficus Auriculata",
      "found": "Native to Asia, it is cultivated from the Himalayas to southern China, Hainan, India and the Malay Peninsula, and in South America in Brazil.",
      "nutrients": "nutrients such as crude protein 5.32%, carbohydrates 27.09%, crude fiber 16.96% and ash content 3.7% and minerals as calcium, magnesium, potassium and phosphorus.",
      "plantDescription": "This plant is a small tree of 5–10 m (16–33 ft) high with numerous bristle-covered branches. The leaves are big and round, and are up to 44 cm (17 in) long and 45 cm (18 in) wide, with cordate or rounded base, acute apex, and 5–7 main veins from the leaf base. Its petioles are up to 15 cm (6 in) long, and it has stipules of about 2.5 cm (1 in) long.",
      "habitat": "Ficus auriculata (Roxburgh fig) is a type of fig tree seen all over Asia noted for its big and round leaves. This is used as fodder in Nepal. It is least resistant to fire, but likes good sunlight.",
      "MedicinalUses" : [
        "Ficus species have been used as traditional medicines to cure diseases, such as, astringents carminatives, stomachic, vermicides, hypotensive, anthelmintic and anti-dysentery drugs.", 
        "Ficus species, such as, Ficus racemosa, F. glomerata, F. glumosa, F. carica, F. religiosa and F. benghalensis are known from ancient times as herbal medicines to treat diabetic disorders as regulating enzymatic activities, carbohydrates absorption rate, increasing insulin sensitivity, insulin secretion, hepatic glycogen synthesis, peripheral glucose uptake and antioxidant status of body. "],
      "HealthBenefits" : [
        "The latex from the stems is applied to cuts and wounds.",
        "The roasted fruit is used in the treatment of diarrhoea and dysentery."]
      },
      {
      "id": 9,
      "leafName": "Ficus Religiosa (Peepal Tree)",
      "ScientificName" : "Ficus Religiosa",
      "found": "India, Nepal, Chad, Thailand, Southwest China, Southeast Asia east to Vietnam",
      "nutrients": "religiosa have been reported to have moisture content of 62.4 g/100 g. The fruits are also rich in macronutrients and micronutrients. Fresh fruits are reported to be a good source of carbohydrates (21.2 g/100 g) and crude fiber (9.9 g/100 g)",
      "plantDescription": "Ficus religiosa is a large dry season-deciduous or semi-evergreen tree up to 30 metres (98 ft) tall and with a trunk diameter of up to 3 metres (9.8 ft). The leaves are cordate in shape with a distinctive extended drip tip; they are 10–17 centimetres (3.9–6.7 in) long and 8–12 centimetres (3.1–4.7 in) broad, with a 6–10 centimetres (2.4–3.9 in) petiole. The fruits are small figs 1–1.5 centimetres (0.39–0.59 in) in diameter, green ripening to purple.",
      "habitat": "F. religiosa occurs naturally in submontane forest, and is grown as an ornamental both within its native range and in places where it has been introduced. In the Middle East, the species is planted as an avenue or roadside tree and is held sacred and commonly planted by Hindus in India near temples.",
      "MedicinalUses" : ["Helps with Fever, Treats Asthma, Treat Eye Pain, Good for oral Health, Helps with Nosebleeds, Treat Jaundice, Helps with constipation, Treats heart disease, Treats dysentery, Helps Diabetes, Treats Ear Infections, Treat skin problems, Asthma, Eczema itching"],
      "HealthBenefits" : [
        "For Asthma : The bark of the Peepal plant and its ripe fruits are helpful for treating asthma. Make a powder of the bark and fruits separately and then mix both of them in equal quantities. Consume this mixture thrice a day for relief from Asthma.",
        "For poor appetite : Eating ripe fruits of the Pipal tree is helpful in treating poor appetite and burning sensation in the stomach. Peepal tree fruit is also known as the sacred fig.",
        "For stomach pain : Peepal leaf is a magical antidote when it comes to treating stomach ailments. You can make tablets for relief from stomach pain by mixing 2-3 peepal leaves with 50gm of jaggery.",
        "For eczema and itching : Did you know that peepal tree bark can be used for preparing tea that is helpful in treating eczema and itching? Not only this, you can even apply the ash from peepal bark leaves to the affected areas to get relief. Just combine 50g of ash from the bark with lemon and ghee to prepare the paste."]
      },
      {
      "id": 10,
      "leafName": "Hibiscus Rosa-sinensis",
      "ScientificName" : "Hibiscus Rosa-sinensis",
      "found": "Africa, Antigua and Barbuda, Asia, Australia, Bangladesh, Bermuda, Burkina Faso, Central Africa, Timor-Leste, Tonga, USA, Vanuatu, Vietnam, West Africa, Zambia, Zimbabwe,",
      "nutrients": "Water : 89.8%,Protein: 0.06g; Fat: 0.4g; Carbohydrate: 0g; Fibre: 1.56g; Ash: 0g;, Minerals - Calcium: 4mg; Phosphorus: 27mg; Iron: 1.7mg; Magnesium: 0mg; Sodium: 0mg; Potassium: 0mg; Zinc: 0mg;,Vitamins - A: 0mg; Thiamine (B1): 0.03mg; Riboflavin (B2): 0.05mg; Niacin: 0.6mg; B6: 0mg; C: 4.2mg;",
      "plantDescription": "Hibiscus rosa-sinensis is a bushy, evergreen shrub or small tree growing 2.5–5 m (8–16 ft) tall and 1.5–3 m (5–10 ft) wide, with glossy leaves and solitary, brilliant red flowers in summer and autumn. The 5-petaled flowers are 10 cm (4 in) in diameter, with prominent orange-tipped red anthers.",
      "habitat": "Woodland Garden Sunny Edge; Dappled Shade; Hedge;",
      "MedicinalUses" : [
        "The chemicals in hibiscus flower helps in growth of hair. It reduces dandruff and makes the hair black.",
        "The natural oil in this flower acts as a good conditioner",
        "This flower can be used as natural dye for hair",
        "The oil in this flower can be applied to the skin of patients who are suffering from cellulite which makes the skin to glow"],
      "HealthBenefits" : [
        "Packed With Antioxidants.",
        "May Help Lower Blood Pressure.",
        "May Help Lower Blood Fat Levels.",
        "May Boost Liver Health.",
        "Could Promote Weight Loss.",
        "Contains Compounds That May Help Prevent Cancer.",
        "Could Help Fight Bacteria."]
      },
      {
      "id": 11,
      "leafName": "Jasminum (Jasmine)",
      "ScientificName" : "Jasminum",
      "found": "It is naturalised in many scattered locales: Mauritius, Madagascar, the Maldives, Christmas Island, Chiapas, Central America, southern Florida, the Bahamas, Cuba, Hispaniola, Jamaica, Puerto Rico, and the Lesser Antilles. ",
      "nutrients": "vitamin A , vitamin b6",
      "plantDescription": "Jasmine can be either deciduous (leaves falling in autumn) or evergreen (green all year round), and can be erect, spreading, or climbing shrubs and vines. Their leaves are borne in opposing or alternating arrangement and can be of simple, trifoliate, or pinnate formation. The flowers are typically around 2.5 cm (0.98 in) in diameter. They are white or yellow in color, although in rare instances they can be slightly reddish. ",
      "habitat": "Jasmines are native to tropical and subtropical regions of Eurasia, Australasia and Oceania, although only one of the 200 species is native to Europe.[7][8] Their center of diversity is in South Asia and Southeast Asia.[9]",
      "MedicinalUses" : [
        "Liver problems such as hepatitis and cirrhosis.",
        "Stomach pain due to severe diarrhea (dysentery).",
        "Increasing sexual desire (as an aphrodisiac).",
        "Cancer treatment.",
        "To cause relaxation (as a sedative)."],
      "HealthBenefits" : [
        "Jasmine has been used for liver disease (hepatitis), liver pain due to cirrhosis, and abdominal pain due to severe diarrhea (dysentery).", 
        "It is also used to cause relaxation (as a sedative), to heighten sexual desire (as an aphrodisiac), and in cancer treatment."]
      },
      {
      "id": 12,
      "leafName": "Mangifera Indica (Mango)",
      "ScientificName" : "Mangifera Indica",
      "found": "The natural distribution of M. indica is in the Indo-Malesian region, specifically India and Myanmar.",
      "nutrients": "Vitamin C,Vitamin E,Vitamin A, Niacin (vit B3), Pantothenic acid (vit B5), Pyridoxine (vit B6), Riboflavin (vit B2)",
      "plantDescription": "The mango tree is a large, spreading evergreen with a dense crown. Mature trees can attain a height of 40 m or more, with a 60-120 cm trunk and greyish-brown, longitude-fissured bark.",
      "habitat": "It is native tropical Asia and has been cultivated in the Indian subcontinent for over 4000 years and is now found naturalized in most tropical countries.",
      "MedicinalUses" : [
        "The leaves are astringent and odontalgic.",
        "The leaves are used to treat skin irritations", 
        "An infusion is drunk to reduce blood pressure and as a treatment for conditions such as angina, asthma, coughs and diabetes."],
      "HealthBenefits" : [
        "Improves digestion ",
        "Lowers Cholesterol",
        "Prevent cancers "]
      },
      {
      "id": 13,
      "leafName": "Mentha (Mint)",
      "ScientificName" : "Mentha",
      "found": "Native to Eurasia, North America, southern Africa, and Australia, mints are widely distributed throughout the temperate areas of the world and have naturalized in many places.",
      "nutrients": "Calories,Fiber, Vitamin A, Iron, Manganese, Folate",
      "plantDescription": "",
      "habitat": "",
      "MedicinalUses" : [
        "May Improve Irritable Bowel Syndrome.",
        "May Help Relieve Indigestion."],
      "HealthBenefits" : [
        "Rich in Nutrients.",
        "Could Improve Brain Function.",
        "May Decrease Breastfeeding Pain.",
        "Subjectively Improves Cold Symptoms.",
        "May Mask Bad Breath.",
        "Easy to Add to Your Diet."]
      },
      {
      "id": 14,
      "leafName": "Moringa Oleifera (Drumstick)",
      "ScientificName" : "Moringa Oleifera",
      "found": "",
      "nutrients": "vitamin A,vitamin B1 (thiamine),B2 (riboflavin),B3 (niacin), B-6,folate and ascorbic acid (vitamin C),calcium,potassium,iron,magnesium,phosphorus,zinc",
      "plantDescription": "",
      "habitat": "",
      "MedicinalUses" : [
        "As a nutritional supplement.",
        "Birth control.",
        "Cancer.",
        "Constipation.",
        "Diarrhea.",
        "Epilepsy.",
        "Headache.",
        "Heart problems.",
        "High blood pressure.",
        "Increasing sex drive.",
        "Infections.",
        "Kidney stones."],
      "HealthBenefits" : [
        "Protecting and nourishing skin and hair",
        "Treating edema",
        "Protecting the liver",
        "Preventing and treating cancer",
        "Treating stomach complaints",
        "Fighting against bacterial diseases",
        "Making bones healthier"]
      },
      {
        "id": 15,
        "leafName": "Muntingia Calabura (Jamaica Cherry-Gasagase)",
        "ScientificName" : "Muntingia calabura",
        "found": "Southern Mexico, Central America, tropical South America, the Greater Antilles, St. Vincent and Trinidad",
        "nutrients": "Vitamin C and carotenoids",
        "plantDescription": "Jamaica Cherry is a very fast-growing tree of slender proportions, reaching 25 to 40 ft in height, with spreading, nearly horizontal branches. The leaves are evergreen, alternate, lanceolate or ovate, long-pointed at the apex, oblique at the base. The flowers with 5 green sepals and 5 white petals and many prominent yellow stamens last only one day, the petals falling in the afternoon. Flowers resemble strawberry bloom, hence the common name, Strawberry tree. The abundant fruits are round, 1-1.25 cm wide, with red or sometimes yellow, smooth, thin, tender skin and light-brown, soft, juicy pulp, with very sweet, musky, somewhat fig-like flavor, filled with exceedingly minute, yellowish seeds, too fine to be noticed in eating. The tree has the reputation of thriving with no care in poor soils. It is drought-resistant but not salt-tolerant. Wherever it grows, fruits are borne nearly all year. The leaf infusion is drunk as a tea-like beverage. Fruits contain hundreds of tiny seeds.",
        "habitat": "It is present in tropical climate in disturbed lowland areas from sea level to 1000 m of elevation.In Kerala, India, it is seen in the areas adjacent to the Western Ghat.",
        "MedicinalUses" : ["The flowers are said to possess antiseptic properties. An infusion of the flowers is valued as an antispasmodic. It is taken to relieve headache and the first symptoms of a cold."],
        "HealthBenefits" : ["Relieves Pain",
      " Prevents Cancer",
      "Reduces blood pressure",
      " Treats gout",
      "Boosts Immunity and Prevents Infections",
      " Relieves Cramps",
      " Keeps Digestive Tract Healthy",
      " Relieves Headaches",
      " Protect against heart attacks",
      " Relieves Inflammation",
      " Manages Blood Sugar Levels",
      " Treats abdominal cramps",
      " Powerful anti-bacterial ingredient"]
        },
        {
        "id": 16,
        "leafName": "Murraya Koenigii (Curry)",
        "ScientificName" : "Murraya koenigii",
        "found": "E. Asia - China, Indian subcontinent, Myanmar, Thailand, Laos, Vietnam.",
        "nutrients": "Calcium 19.75 mg/100g, magnesium 49.06 ± 0.02 mg/100g, sodium 16.50 ± 0.21 mg/100g, potassium and zinc 0.04 ± 0.001 mg/100g each.",
        "plantDescription": "Curry Leaf makes a wonderful potted plant for your culinary collection of aromatic herbs. The fragrant leaf has a nutty, pungent flavor and is a prized addition to South Indian foods. Logee’s Curry Leaf plant is highly valued by both the chef and gardener.",
        "habitat": "Dry lowland woodland. Moist forests at elevations of 500 - 1,600 metres in southern China.",
        "MedicinalUses" : ["Curry leaf contains several medically active constituents including a glycoside called koenigin, an essential oil and tannins."," It is a warming, strongly aromatic herb that improves appetite and digestion.","The leaves, roots and bark can all be used internally in the treatment of digestive problems [238 ]. It has been shown that the leaves increase digestive secretions and relieve nausea, indigestion and vomiting." ],
        "HealthBenefits" : ["Weight loss.",
      "It can help in treating dysentery, constipation and diarrhea.",
      "Relieves morning sickness and nausea.",
      "Heals wounds, burns and skin eruptions.",
      "Good for diabetics."
      ]
        },
        {
        "id": 17,
        "leafName": "Nerium Oleander (Oleander)",
        "ScientificName" : "Nerium oleander ",
        "found": "China, India",
        "nutrients": "-",
        "plantDescription": "Oleander is a rapidly growing evergreen, rounded shrub or small tree native to Europe and Asia.  It grows to heights between 6.5' and 19.5' tall and 6' to 10' wide. Its large size makes it an ideal choice for use as a screening plant, or in the back of a border. It prefers full sun to partial shade and well-drained and fertile soil, although it is adaptable to many soil conditions. This plant blooms in late spring to late summer and it comes in a variety of flower colors.  The fruits are nonornamental.  When branches are broken they exude a thick, gummy, sap which can cause contact dermatitis.",
        "habitat": "Nerium oleander is either native or naturalized to a broad area spanning from Northwest Africa and Iberian peninsula eastward through the Mediterranean region, to the Arabian peninsula, southern Asia, and as far east as Yunnan in southern parts of China.",
        "MedicinalUses" : ["Oleander is used for heart problems, cancer, skin problems, and other"],
        "HealthBenefits" : ["Oleander has traditionally been used in the treatment of cardiac illness, asthma, diabetes mellitus, corns, scabies, cancer, and epilepsy."]
        },
        {
        "id": 18,
        "leafName": "Nyctanthes Arbor-tristis (Parijatka)",
        "ScientificName" : "Nyctanthes Arbor-tristis",
        "found": "West Bengal region in India, and for Kanchanaburi Province, Thailand.",
        "nutrients": "-",
        "plantDescription": "Har singar should not be confused with the West Indian shrub Cestrum nocturnum, also called queen of the night. Nyctanthes arbortristis literally means, night-blooming sad tree. Grows as large shrub or small tree depending on how it is trained. The large attractive leaves are rough and hairy. The sweet scented flowers are small, attractive with white petals and an orange-red tube in center and bloom profusely, opening at night and drop off in the morning, thus making a carpet of flowers in the morning. Used for worship. Needs warmth during winter months. Use well drained soil and fertilize once a month.",
        "habitat": "Native to the subtropical Himalayas of Nepal and India; it is more found in southern parts of India, and in South-East Asian country such as Thailand, Malaysia and Indonesia.",
        "MedicinalUses" : ["Parijat is known as a great anti-pyretic. It cures various nauseous types of fever including malaria, dengue, and chikungunya fevers. Recent studies suggest that Parijat leaf and bark extract are very useful to ameliorate fever instantly. It helps to increase platelet count in dengue and chikungunya fever."],
        "HealthBenefits" : ["Reduces inflammation", 
      "Treats fever",
      "Manages arthritis",
      "Prevents oxidative damage" ]
        },
        {
        "id": 19,
        "leafName": "Ocimum Tenuiflorum (Tulsi)",
        "ScientificName" : "Ocimum tenuiflorum",
        "found": "E. Asia - China, Indian subcontinent, Myanmar, Thailand, Cambodia, Laos, Vietnam, Malaysia, Indonesia, Philippines, New Guinea, northern Australia.",
        "nutrients": "Vitamin A and C, calcium, zinc, iron, chlorophyll.",
        "plantDescription": "Holy basil, (Ocimum tenuiflorum), also called tulsi or tulasi, flowering plant of the mint family (Lamiaceae) grown for its aromatic leaves. Holy basil is native to the Indian subcontinent and grows throughout Southeast Asia. The plant is widely used in Ayurvedic and folk medicine, often as an herbal tea for a variety of ailments, and is considered sacred in Hinduism. It is also used as a culinary herb with a pungent flavour that intensifies with cooking. It is reminiscent of clove, Italian basil (Ocimum basilicum), and mint and has a peppery spiciness. It is considered an agricultural weed and an invasive species in some areas outside its native range.",
        "habitat": "Naturalized in waste places or in settled areas and thickets.",
        "MedicinalUses" : ["Sacred basil is a very important herb in the Ayurvedic tradition", "A pungently aromatic, warming, antiseptic herb; it induces perspiration; lowers fevers; relaxes spasms; eases pain; clears bacterial infections; strengthens the immune and nervous systems; reduces inflammations; and benefits the digestive system[238 , 254 , 272 , 348 ]. Research has shown that the herb has the ability to lower blood sugar levels.", "The essential oils from the leaf have shown antibacterial and antifungal activity. They contain methylchaviol, eugenol and other volatile, commercial oils"],
        "HealthBenefits" : ["Protect against infection and treat wounds. Extracts made from its leaves are thought to boost wound healing speed and strength.", "Lower your blood sugar.", "Lower your cholesterol", "Ease inflammation and joint pain."]
        },
        {
        "id": 20,
        "leafName": "Piper Betle (Betel)",
        "ScientificName" : "Piper betle",
        "found": "India and Sri Lanka",
        "nutrients": "Nutrient composition of dried Betel leaves powder shows 84.5% of moisture, 1.2g of ash, 5.6g of carbohydrate, 2.9 g of protein, 0.5g of fat,2g of crude fibre, 4.5mg of Vitamin C and 9.8mg of Iron",
        "plantDescription": "Betel Vine is an evergreen and perennial creeper, with glossy heart-shaped leaves, producing woody stems 5-20 m long. The stems produce adventitious roots, with which they can adhere to other plants etc for support. Leaves are light green to bright green, glossy, deeply veined and hairless. They are heart-shaped with entire leaf margin. Lleaf stalk is reddish like the stem. Flowers are white catkins developed on the nodes, erect or pendulous. Flowers are small, without sepal and petal. Fruits are fleshy, spherical to ellipsoidal. The primary use of betel leaf is as a wrap for chewing of betel nut or tobacco where it is mainly used to add flavour. Betel vine is native to India and SE Asia.",
        "habitat": "Betel pepper thrives under per-humid forest conditions with high relative humidity and ample supply of soil moisture. It flourishes in areas with 2250-4750 mm annual rainfall and is cultivated at altitudes up to 900 m. It prefers shade and needs protection from wind.",
        "MedicinalUses" : ["The leaves, roots and seeds are all used for medicinal purposes in Asia. Leaf preparations and the leaf sap are applied to wounds, ulcers, boils and bruises. Heated leaves are applied as a poultice on the chest against cough and asthma, on the breasts to stop milk secretion, and on the abdomen to relieve constipation. The leaves are also used to treat nosebleed, ulcerated noses, gums and mucous membranes while the extract from the leaves is applied for wounds in the ears and as an infusion for the eye. A decoction of the leaves is used to bathe a woman after childbirth, or is drunk to lessen an unpleasant body odour."],
        "HealthBenefits" : ["Anti-diabetic Agent.", "Lowers High Cholesterol Levels.", "Anti-cancer Agent.", "Anti-microbial Agent.", "Helps in Wound Healing.", "Helps Overcome Depression."]
        },
        {
        "id": 21,
        "leafName": "Plectranthus Amboinicus (Mexican Mint)",
        "ScientificName" : "Plectranthus Amboinicus",
        "found": "Southern Africa, Arabia, India, Southeast Asia, Europe, Spain, America.",
        "nutrients": "Contain several classes of phytochemicals including monoterepenoids, diterpenoids, triterpenoids, sesquiterpenoids, phenolics, flavonoids and esters.",
        "plantDescription": "Mexican Mint is a sprawling and somewhat succulent herb, growing to 1 m tall. The plant is sometimes prostrate at base, with the branchlets rising up, densely hairy. Leaves have stalks 1-4.5 cm long, densely velvety, like most mint family plants. Leaf blade is fleshy, broadly ovate to circular, rhombic, or kidney-shaped, 4-10 cm long, 3-9 cm broad, coarsely toothed at margin or entire toward base. Flowers are borne in 10-20-flowered, densely velvety spikes, 10-20 cm long. Flower stalks are slender, up to 5 mm long. Sepal cup is bell-shaped, 1.5-4 mm long. Flowers are pale blue or mauve to pink, 8-12 mm long - the upper lip is up to 4.5 x 3 mm, erect, the lower lip up to 5-6 x 4 mm, concave. Filaments of stamens are mostly fused into a tube around style. The origin of Cuban Oregano is unknown - it is widely cultivated world-wide. The leaves are strongly flavoured and make an excellent addition to stuffings for meat and poultry. Finely chopped, they can also be used to flavour meat dishes, especially beef, lamb and game.",
        "habitat": "Coleus amboinicus is native to Southern and Eastern Africa, from South Africa (KwaZulu-Natal) and Eswatini to Angola and Mozambique and north to Kenya and Tanzania, where it grows in woodland or coastal bush, on rocky slopes and loamy or sandy flats at low elevations.",
        "MedicinalUses" : ["The leaves have also had many traditional medicinal uses, especially for the treatment of coughs, sore throats and nasal congestion, but also for a range of other problems such as infections, rheumatism and flatulence. In Indonesia Cuban Oregano is a traditional food used in soup to stimulate lactation for the month or so following childbirth."],
        "HealthBenefits" : ["Relieves Respiratory Issues", "Skin Care", "Enhances Diuresis", "Relieves from Fever"]
        },
        {
        "id": 22,
        "leafName": "Pongamia Pinnata (Indian Beech)",
        "ScientificName" : "Pongamia Pinnata",
        "found": "E. Asia - Indian subcontinent, through south-east Asia to north-eastern Australia, Fiji and Japan.",
        "nutrients": "Air-dry kernels have 19.0% moisture, 27.5% fatty oil, 17.4% protein, 6.6% starch, 7.3% crude fiber, and 2.4% ash. Fatty acid composition: palmitic, 3.7–7.9%, stearic 2.4–8.9, arachidic 2.2–4.7, behenic 4.2–5.3, lignoceric 1.1–3.5, oleic, 44.5–71.3, linoleic 10.8–18.3, and eicosenoic 9.5–12.4%",
        "plantDescription": "A fast-growing deciduous tree up to 20 metres tall that is thought to have originated in India and is found throughout Asia. It is a deciduous tree that grows to about 15-25 meters in height with a large canopy that spreads equally wide. The leaves are a soft, shiny burgundy in early summer and mature to a glossy, deep green as the season progresses. Small clusters of white, purple, and pink flowers blossom on their branches throughout the year, maturing into brown seed pods. The tree is well suited to intense heat and sunlight and its dense network of lateral roots and its thick, long taproot make it drought tolerant. Flowering: March-April.",
        "habitat": "Occurs naturally in lowland forest on limestone and rocky coral outcrops on the coast, along the edges of mangrove forest and along tidal streams and rivers, often with its roots in fresh or saltwater.",
        "MedicinalUses" : ["A thick brownish oil can be extracted from the large seeds, and is used industrially and in medicine, notably for the treatment of rheumatism."],
        "HealthBenefits" : ["Plant is useful for hemorrhoids, dyspepsia, skin diseases, hemorrhoids, bronchitis, rheumatism, herpes, cough, sores, spleen enlargement, diabetes, ulcers and sores."]
        },
        {
        "id": 23,
        "leafName": "Psidium Guajava (Guava)",
        "ScientificName" : "Psidium Guajava",
        "found": "Australia, New Zealand, south-eastern USA, tropical and temperate Asia, tropical and southern Africa and many oceanic islands with warm climates.",
        "nutrients": "Every 100 g serves 36–50 kcal of calories, 77–86 g of moisture, 2.8–5.5 g of fiber, 0.43–0.7 g of ash, 9.1–17 mg of calcium , 17.8–30 mg of phosphorus, 0.30–0.70 mg of iron , 200–400 I.U. of vitamin A, 0.046 mg of thiamine, 0.03–0.04 mg of riboflavin, 0.6–1.068 mg of niacin, and 100 mg of ascorbic acid.",
        "plantDescription": "Guava (Psidium guajava L.) is an important tropical tree cultivated for its fruits. The fruit processing by-products, the leaves and the fruits themselves can be used to feed livestock though their nutritional value is low.",
        "habitat": "Agricultural areas, forest edges, natural forests, riparian zones (banks of watercourses), ruderal/disturbed, scrub/shrublands in higher rainfall areas.",
        "MedicinalUses" : ["It is used for inflammation, diabetes, hypertension, caries, wounds, pain relief, fever, diarrhea, rheumatism, lung diseases, and ulcers."],
        "HealthBenefits" : ["May Help Lower Blood Sugar Levels.", "May Boost Heart Health.", "May Help Relieve Painful Symptoms of Menstruation.", "May Benefit Your Digestive System", "May Aid Weight Loss.", "May Have an Anticancer Effect.", "Eating Guavas May Be Good for Your Skin."]
        },
        {
        "id": 24,
        "leafName": "Punica Granatum (Pomegranate)",
        "ScientificName" : "Punica Granatum",
        "found": "Afghanistan, Iran, North Caucasus, Pakistan, Tajik,  Alabama, Albania, Algeria, Andaman Islands.",
        "nutrients": "Pomegranate contains strong antioxidant activity and has a high source of ellagitannins, anthocyanins, and hydrolysable tannins. The most components of the pomegranatesare tannin and polyphenolics.",
        "plantDescription": "Punica granatum L (pomegranate) is a deciduous shrub, native to Iran. Nowadays, besides its use as a fruit, its medicinal properties have attracted the interest of researchers of many countries. Pomegranate fruit has medicinal properties such as anti-inflammatory and antibacterial activities. The pomegranate seed oil has inhibitory effect on skin and breast cancers. The pomegranate seed oil has phytoestrogenic compounds and the fruit is rich in phenolic compounds with strong antioxidant activity. Ellagic acid is one of the main components of pomegranate with phenolic structure and antioxidant activity. This review article presents the recently published findings on different aspects of this plant focusing on its medicinal properties",
        "habitat": "Grows in well-drained soils in sheltered positions with full sun at an altitude of 1000 — 2775m.",
        "MedicinalUses" : ["The plant is also rich in tannin, which makes it an effective astringent. It is used externally in the treatment of vaginal discharges, mouth sores and throat infections.The whole plant, but in particular the bark, is antibacterial, antiviral and astringent.  Along with the leaves and seeds, they have been used to remove worms.The fruit is a mild astringent and refrigerant in some fevers and especially in biliousness."],
        "HealthBenefits" : ["Help Fight Prostate Cancer.", "Useful Against Breast Cancer.", "Lower Blood Pressure."]
        },
        {
        "id": 25,
        "leafName": "Santalum Album (Sandalwood)",
        "ScientificName" : "Santalum Album",
        "found": "India, eastern Indonesia and northern Australia",
        "nutrients": "K, Ca, N and Cu.",
        "plantDescription": "Sandalwood is an evergreen tree, growing up to 4-9 m tall. The trees have a long life, and may live up to one hundred years of age. The tree is variable in habit, usually upright to sprawling, and may intertwine with other species. The plant parasitises the roots of other tree species, but without major detriment to its hosts. The reddish or brown bark can be almost black and is smooth in young trees, becoming cracked with a red reveal. The heartwood is pale green to white as the common name indicates. The oval leaves are thin, oppositely arranged. Smooth surface is shiny and bright green, with a glaucous pale underside. Fruit is produced after three years, viable seeds after five. These seeds are distributed by birds.",
        "habitat": "S. album occurs from coastal dry forests up to 700 metres (2,300 ft) elevation. It normally grows in sandy or well drained stony red soils, but a wide range of soil types are inhabited. This habitat has a temperature range from 0 to 38 °C (100 °F) and annual rainfall between 500 millimetres (20 in) and 3,000 millimetres (120 in).",
        "MedicinalUses" : ["Sandalwood oil was used traditionally to treat skin diseases, acne, dysentery, gonorrhea, and a number of other conditions. In traditional Chinese medicine, sandalwood oil is considered an excellent sedating agent."],
        "HealthBenefits" : ["increase alertness.", "manage anxiety.", "support wound healing.", "guard against skin cancer.", "fight bacteria."]
        },
        {
        "id": 26,
        "leafName": "Syzygium Cumini (Jamun)",
        "ScientificName" : "Syzygium Cumini",
        "found": " India, Bangladesh, Nepal and Pakistan",
        "nutrients": "Vitamin A, vitamin C, calcium, iron, fibre, magnesium, potassium, glucose, protein and carbohydrates. ",
        "plantDescription": "The evergreen jamun plant is originally from Indonesia and India. Indian mythology describes the Indian subcontinent as an island, 'situated in the centre of the world', called Jambudweep. Because of a majority of Jamun (black berry) trees, this island was named as Jambudweep. An evergreen tropical tree, 50 to 100 ft. tall, with oblong opposite leaves that are smooth, glossy and having a terpentine smell. Jamun has fragrant white flowers in branched clusters at stem tips and purplish-black oval edible berries. The leaves are antibacterial, and are used for strengthning the teeth and gums. The fruit and seeds are sweet, acrid, sour, tonic, and cooling, and are used in diabities, diarrhoea and ringworm. The bark is astringent, sweet sour, diuretic, digestive and anthelmintic.",
        "habitat": "Syzygium cumini is a fast-growing tropical and sub-tropical tree preferring moist, riverine habitats, that is valued for its fruit, timber and as an ornamental and as such has been widely introduced from its native South Asia.",
        "MedicinalUses" : [" From all over the world, the fruits have been used for a wide variety of ailments, including cough, diabetes, dysentery, inflammation and ringworm. It is also an ancient medicinal plant with an illustrious medical history and has been the subject of classical reviews for over 100 years. It is widely distributed throughout India and ayurvedic medicine (Indian folk medicine) mentions its use for the treatment of diabetes mellitus. Various traditional practitioners in India use the different parts of the plant in the treatment of diabetes, blisters in mouth, cancer, colic, diarrhea, digestive complaints, dysentery, piles, pimples and stomachache."],
        "HealthBenefits" : ["May Help Manage Diabetes", "Boosts Stomach Health", "Helps Regulate Blood Pressure", "May Boost Immunity", "Aids Weight Loss"]
        },
        {
        "id": 27,
        "leafName": "Syzygium Jambos (Rose Apple)",
        "ScientificName" : "Syzygium Jambos",
        "found": "E. Asia - Malaysia.",
        "nutrients": "Vitamin C (24.78%) Vitamin B3 (5.00%) Carbohydrate(4.38%) Dietary Fiber (3.95%) Calcium (2.90%)",
        "plantDescription": " Rose Apple is an evergreen tree up to 10 m tall. The terminal inflorescence is showy and usually carries four whitish-green flowers on the outside of the crown. The leaves are lanceshaped, 2-4 cm broad, 10 cm to 20 cm long, pointed, base wedge-shaped with hardly any leaf-stalk, lively red when growing, but dark, glossy green on attaining full size. The showy flowers are in small clusters at branch-ends, white or greenish white, the long, numerous stamens giving them a diameter of 5-8 cm. The fruits are whitish-green, rose scented, about 5 cm long and ripen over an extended period. The edible fruit is shaped like a small pear. The flesh is a bit softer than that of an apple. It tastes like a cross between apple and watermelon, with a very mild rose scent and a slightly bitter aftertaste. In ancient Sanskrit, the land now called India was referred to by the ancient Indians themselves as Jambudvipa, which means Rose-apple-land (jambu = rose apple; dvipa = land). The dry, crisp fresh fruit is used to make jellies. Fruit/seed can be produced following self-pollination. Rose Apple is native to India, China and SE Asia. ",
        "habitat": "Open places, generally around villages, at elevations of 600 - 1,400 metres in Nepal. Most commonly found in moister habitats such as stream banks, becoming more frequent at higher elevations as rainfall levels rise.",
        "MedicinalUses" : ["Several parts of the tree are used medicinally as a tonic or a diuretic. In India, the fruit is regarded as a tonic for the brain and liver. An infusion of the fruit acts as a diuretic. A sweetened preparation of the flowers is believed to reduce fever. The seeds are employed against diarrhoea, dysentery and catarrh"],
        "HealthBenefits" : ["Prevent Diabetes", "Prevent Constipation", "Prevent muscle cramps", "Skin Health", "Eliminate free radicals"]
        },
        {
        "id": 28,
        "leafName": "Tabernaemontana Divaricata (Crape Jasmine)",
        "ScientificName" : "Tabernaemontana Divaricata ",
        "found": "E. Asia - southern China, India, Myanmar, Thailand.",
        "nutrients": "Phytochemical studies on various parts reveal that this plant contains at least 66 indole alkaloids, non-alkaloidal constituents like enzymes, flavonoids, hydrocarbons, phenolic acids, phenyl propanoids, steroids and terpenoids.",
        "plantDescription": "Crape jasmine, a shrub very common in India, generally grows to a height of 6 ft. However, it can also grow into a small tree with a thin, crooked stem. Like many members of the Oleander family, stems exude a milky latex when broken. The large shiny leaves are deep green and are 6 or more inches in length and about 2 inches in width. Crape jasmine blooms in spring but flowers appear sporatically all year. The waxy blossoms are white five-petaled pinwheels that are borne in small clusters on the stem tips. Flowers are commonly used in pooja in north and south India.",
        "habitat": "Montane brushwoods, sparse forests; at elevations of 100 - 1,600 metres in southern China. Light forest, usually in the hills, from sea-level to 1,400 metres. ",
        "MedicinalUses" : ["Grape jasmine is widely used as a medicinal herb in the tropics. Indeed, in India the applications in traditional medicine are so numerous that the plant may well be classified as a panacea for gastro-intestinal, urogenital and skin affections.The roots are astringent. A decoction is used in the treatment of diarrhoea and various abdominal complaints. An infusion is applied as a remedy for jungle fever. The roots are used in modern medicine to treat hypertension, headache, and scabies.The pounded roots are applied to sore eyes. The root is employed as a local anodyne and chewed for the relief of toothache."],
        "HealthBenefits" : ["Used for liver disease", "liver pain due to cirrhosis", "abdominal pain due to severe diarrhea", "as a sedative", "to heighten sexual desire", " in cancer treatment"]
        },
        {
        "id": 29,
        "leafName": "Trigonella Foenum-graecum (Fenugreek)",
        "ScientificName" : "Trigonella Foenum-graecum ",
        "found": "Europe - S. France.",
        "nutrients": "The fenugreek seeds have 58% carbohydrates, 23-26% proteins, 0.9% fats and 25% fibre. Similarly, fenugreek leaves have 6%, 4.4%, 1.1% carbohydrates, proteins and fibre respectively.",
        "plantDescription": "Fenugreek is an annual plant in the family Fabaceae, with leaves consisting of three small obovate to oblong leaflets. It is cultivated worldwide as a semiarid crop. Its seeds and leaves are common ingredients in dishes from the Indian subcontinent, and has been used as a culinary ingredient since ancient times.",
        "habitat": "Field verges, uncultivated ground, dry grasslands and hillsides.",
        "MedicinalUses" : ["The seeds are very nourishing and are given to convalescents and to encourage weight gain, especially in anorexia nervosa. The seeds should not be prescribed medicinally for pregnant women since they can induce uterine contractions . Research has shown that the seeds can inhibit cancer of the liver, lower blood cholesterol levels and also have an antidiabetic effect. The seed and leaves are anticholesterolemic, anti-inflammatory, antitumor, carminative, demulcent, deobstruent, emollient, expectorant, febrifuge, galactogogue, hypoglycaemic, laxative, parasiticide, restorative and uterine tonic."],
        "HealthBenefits" : ["Reduce the risk of diabetes", "Improve milk production and flow.", "Improve weight loss.", "Raise testosterone and boost sperm count.", "Reduce the risk of heart and blood pressure conditions"]
        }
]
